# WidthParameterError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..WidthParameterError Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
This is used to post error.The "External Diameter" parameter must be set to a strictly positive value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WidthParameterError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WidthParameterError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WidthParameterError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace